privacy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Privacy Resources</title>
<!-- 2020-09-01 Tue 19:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Evan James McCarter" />
</head>
<body>
<div id="content">
<h1 class="title">Privacy Resources</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. People Search</a>
<ul>
<li><a href="#sec-1-1">1.1. Overview</a></li>
<li><a href="#sec-1-2">1.2. Opt-out</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Whitepages</a></li>
<li><a href="#sec-1-2-2">1.2.2. Spokeo</a></li>
<li><a href="#sec-1-2-3">1.2.3. TruePeopleSearch</a></li>
<li><a href="#sec-1-2-4">1.2.4. Other</a></li>
<li><a href="#sec-1-2-5">1.2.5. Paid databases</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> People Search</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Services such as <a href="https://whitepages.com">Whitepages</a> and <a href="https://spokeo.com">Spokeo</a> collect and associate public data into profiles on individuals.
These records include home addresses, previous addresses, phone numbers, relatives.
Because they source from public data only the institutions supplying that data can permanently stop information about you from spreading.
The sources are usually government institutions which have inherent mandates to open records however.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Opt-out</h3>
<div class="outline-text-3" id="text-1-2">
<p>
You can request that individual pages be removed from each website
if you locate actual pages with personal information about you.
</p>
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Whitepages</h4>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>Search <a href="https://whitepages.com">Whitepages</a> for your listing URL, which takes the form of <a href="https://www.whitepages.com/name/Your-Name/Your-City/">https://www.whitepages.com/name/Your-Name/Your-City/</a>
</li>
<li>Save your listing URL to later verify that it has been deleted
</li>
<li>Go to <a href="https://www.whitepages.com/suppression_requests">https://www.whitepages.com/suppression_requests</a> and supply your listing URL and other non-identifying information they ask for
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Spokeo</h4>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>Search <a href="https://spokeo.com">Spokeo</a> for your profile URL
</li>
<li>Save your profile URL to later verify that it has been deleted
</li>
<li>Follow the instructions on <a href="https://www.spokeo.com/optout">https://www.spokeo.com/optout</a>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> TruePeopleSearch</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Follow the instructions on <a href="https://www.truepeoplesearch.com/removal">https://www.truepeoplesearch.com/removal</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Other</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
<a href="https://www.reputationdefender.com/blog/privacy/how-remove-yourself-top-peoplesearch-sites">https://www.reputationdefender.com/blog/privacy/how-remove-yourself-top-peoplesearch-sites</a> has a list of opt-out procedures for common websites.
</p>
</div>
</div>
<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Paid databases</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
There are tens if not hundreds of websites that require payment before displaying any personal information,
including separate databases on Whitepages and Spokeo.
They require that you find the information before they will remove it.
This applies to the paid information on Whitepages and Spokeo:
your private profile will still be available until you explicitly request its removal
even if you remove your public profile.
It is prohibitively expensive and time consuming to remove all information about you from paid databases therefore.
Additionally, every "loading" page is a guarantee that the site requires payment to complete the search.
All sites that have a loading page merely do so to build suspense and waste your time.
</p>

<p>
There are some services that trawl people search websites and submit opt-out requests on your behalf.
</p>

<p>
Another alternative is providing some personal information such as a picture of your photo ID to convince some websites to remove your information.
<a href="https://www.reddit.com/r/technology/comments/31u84n/how_to_remove_yourself_from_most_background_check/">https://www.reddit.com/r/technology/comments/31u84n/how_to_remove_yourself_from_most_background_check/</a> has an (outdated) list of examples with opt-out forms.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Evan James McCarter</p>
<p class="date">Created: 2020-09-01 Tue 19:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
